{
  "products": [
    {
      "product_name": "Intel 13th Gen Core i5 13600K Raptor Lake Processor",
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/core-i5-13600k/Core%20i5%2013600K-01-228x228.webp",
      "category": "processor",
      "price": 36000,
      "status": "In Stock",
      "rating": 4.9,
      "keyFeatures": [
        "Model: Core i5 13600K",
        "Clock Speed: 3.50 GHz up to 5.10 GHz",
        "Cache: 24 MB",
        "Socket: LGA1700",
        "CPU Cores: 14",
        "CPU Threads: 20",
        "Graphics: Intel UHD Graphics 770"
      ],
      "description": "The Intel Core i5-13600K 3.5 GHz 14-Core LGA 1700 Processor will boost your productivity, gaming, and content production. This 13th-generation desktop CPU expands on the Hybrid Core design and Intel 7 process by packing 14 cores onto a single chip, four more than the prior generation, while still fitting the LGA 1700 socket. The Core i5-13600K is designed to deliver powerful performance for everyday workloads, with eight low-voltage Efficient-cores handling background tasks for multitasking and six 3.5 GHz Performance-cores powering programs and games. The built-in Intel Thread Director guarantees that the two function in unison by dynamically and intelligently distributing tasks to the appropriate core at the appropriate moment. With 24MB of cache and a Turbo Boost Max 2.0 clock of 5.1 GHz, this CPU is designed to handle a wide range of workloads. This CPU may also be overclocked for increased performance. PCI Express 5.0 and dual-channel DDR5 ECC memory at 5600 MHz are also supported by the Core i5-13600K. The Core i5-13600K has integrated Intel UHD 770 Graphics. It provides quick, rich 3D performance for high-quality images, with support for one 7680 x 4320 resolution 8K monitor or up to four 3840 x 2160 resolution 4K monitors with great dynamic range. The Intel 13th Gen Core i5 13600K Processor comes with a 03-year warranty."
    },
    {
      "product_name": "Intel 11th Gen Core i7-11700 Rocket Lake Processor",
      "image": "https://www.startech.com.bd/image/cache/catalog/processor/Intel/i7-11700/i7-11700-500x500.jpg",
      "category": "processor",
      "price": 29500,
      "status": "In Stock",
      "rating": 4.9,
      "keyFeatures": [
        "Model: Core i7-11700",
        "Clockspeed: 2.50 GHz Up to 4.90 GHz",
        "Cache: 16 MB",
        "Socket: LGA 1200",
        "CPU Cores: 8",
        "CPU Threads: 16",
        "GPU name: Intel UHD Graphics 750"
      ],
      "description": "Intel 11th Gen Core i7-11700 Rocket Lake Processor. This Core i7-11700 Processor comes with Intel UHD Graphics 750. This new 11th gen Rocket Lake microarchitecture is manufactured with the 14nm process that comes with eight cores and 16 threads. These Processors also support 64-bit computing on Intel architecture requires an Intel x86-64 (64 bit) architecture-enabled BIOS. As this chip is updated to the latest BIOS revision, it nicely fits into any Intel 400 and 500 series motherboards. Focusing on this, all the major motherboard manufacturers have already started BIOS updates for their 400 and 500 series lineup. Core Benefits of the Processor. Intel 11th Generation Core i7-11700 Processor having a base frequency of 2.50 GHz that can be reached as max turbo frequency at 4.90 GHz. The processor has a compatibility socket of LGA 1200 that is supported by 400 and 500 series Intel motherboards. It has a SmartCache of 16 MB containing 8 cores and 16 threads. With a bus speed of 8 GT/s, it has thermal design power (TDP) rating of 65W. This latest microchip has few expansion options such as 4.0 PCI express revision having configured up to 1x16, 2x8, 1x8+2x4, and a maximum of 16 lanes. Considering the memory this processor has a dual-channel of max 128GB of the size that supports up to DDR4-3200 bus speed."
    }
  ],
  "categories": [
    "processor",
    "Cooler",
    "Motherboard",
    "RAM",
    "Storage",
    "Graphics Card (GPU) Complete",
    "Power Supply",
    "Casing",
    "Monitor",
    "Keyboard",
    "Mouse",
    "Headphone",
    "UPS"
  ]
}
